Repository: limdizz/ppc-2025-processes-engineers
Catalog: docs/locale/*/LC_MESSAGES/user_guide/submit_work.po
Languages: ru

source: How to submit your work
ru: Как создать, открыть и отправить на проверку Вашу работу

source: There are ``all``, ``mpi``, ``omp``, ``seq``, ``stl``, ``tbb`` folders in the ``tasks`` directory. Move to a folder of your task. Create a directory named ``<last name>_<first letter of name>_<short task name>``.
ru: Существуют следующие типы ``all``, ``mpi``, ``omp``, ``seq``, ``stl``, ``tbb`` поддиректорий (типов задач) в ``tasks`` директории. Ваша директория будет размещаться в директории согласно типу Вашей задачи. Создайте поддиректорию и назовите ее латинскими буквами следующим образом - ``<фамилия>_<первая буква имени>_<краткое название задачи>``.

source: Example: ``seq/nesterov_a_vector_sum``. Please name all tasks **with the same** name directory. If the ``seq`` task is named ``seq/nesterov_a_vector_sum``, then the ``omp`` task must be named ``omp/nesterov_a_vector_sum``.
ru: Пример: ``seq/nesterov_a_vector_sum``. Пожалуйста называйте все задачи **одинаково**, если у вас одна задача и несколько технологий. Если Ваша задача ``seq`` то задача будет размещена следующим образом - ``seq/nesterov_a_vector_sum``, если ``omp`` то так ``omp/nesterov_a_vector_sum``.

source: Navigate into the newly created folder and begin your work on the task. The folder must contain only 4 directories with files:
ru: Перейдите в созданную Вами, директорию и начните работу. Директория должна содержать 4 обязательных поддиректории с файлами и 1 опциональную:

source: ``data`` - Directory with own data files for functional testing of the task.
ru: ``data`` - Опциональная директория с тестовыми файлами для экспериментов и тестов

source: ``func_tests`` - Directory with Google tests for functional testing of the task.
ru: ``func_tests`` - Директория с Google тестами для функционального тестирования.

source: ``include`` - Directory for header files with function prototypes.
ru: ``include`` - Директория с header файлами, в которых содержатся чаще всего прототипы ваших функций и классов.

source: ``perf_tests`` - Directory with Google tests for performance testing. The number of tests must be 2: ``run_task`` and ``run_pipeline``.
ru: ``perf_tests`` - Директория с Google тестами для тестов на производительность. Должно быть всего 2 теста: ``run_task`` и ``run_pipeline``.

source: ``src`` - Directory with source files containing the function implementations.
ru: ``src`` - Директория с исходными кодами, содержащая основную реализацию задач.

source: There must be 10 executable files for running:
ru: При максимальной конфигурации должно быть 12 исполняемых файлов для запуска:

source: ``<all, mpi, omp, seq, stl, tbb>_<func, perf>_tests``. For example, ``omp_perf_tests`` - an executable file for performance tests of OpenMP practice tasks.
ru: ``<all, mpi, omp, seq, stl, tbb>_<func, perf>_tests``. К примеру, ``omp_perf_tests`` - исполняемый файл запуска тестов на производительность, задач, связанных с технологией OpenMP.

source: All prototypes and classes in the ``include`` directory must be namespace-escaped. Name your namespace as follows:
ru: Все Ваши прототипы и классы в ``include`` директории должны быть экранированы с помощью namespace. Имя namespace должно соотвествовать следующему примеру:

source: Name your group of tests and individual test cases as follows:
ru: Имя вашей группы тестов и одного ндивидуального тест кейса должно именоваться так:

source: For functional tests (for maximum coverage):
ru: Для функциональных тестов (для максимального покрытия):

source: For performance tests (only 2 tests - ``pipeline`` and ``task`` - no more no less):
ru: Для тестов на производительность (только 2 теста - ``pipeline`` and ``task`` - ни больше, ни меньше):

source: Name your pull request as follows:
ru: Имя вашего pull request должно называться следующим образом:

source: For tasks:
ru: Для задач:

source: Provide the full task definition in the pull request's description.
ru: Приведите полную формулировку задачи в описании pull request.

source: Example pull request can be found in the repository's pull requests.
ru: Пример pull request может быть найден в основном репозитории в разделе pull requests.

source: Work on your forked repository. Keep your work on a separate branch (not on ``master``)!!! Name your branch the same as your task's folder. To create a branch, run:
ru: Работайте в своем собственном fork-репозитории. Каждую задачу нужно делать на новой ветке (не на ``master`` ветке)!!! Имя ветки такое же как и имя директории Вашей задачи. Для создания ветки воспользуйтесь следующей командой:

source: **Failing to follow the rules will result in a red project build.**
ru: **Несоблюдение правил приведет к падению сборки проекта.**
